In [1]:
import pandas as pd

In [3]:
data = [
    ["Jon", 25, "Seattle"],
    ["Robb", 30, "New York"],
    ["Danerys", 35, "Kona"]
]

df_list = pd.DataFrame(
    data,
    columns=["Name", "Age", "Location"],
    index=[1, 2, 3]
)

df_list

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [4]:
df_list.head()

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [5]:
df_list.tail()

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [6]:
df_list.shape

(3, 3)

In [7]:
df_list.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [8]:
df_list.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [9]:
df_list["Age"].max()

35

In [10]:
df_list["Age"].min()

25

In [11]:
df_list["Age"].mean()

np.float64(30.0)

In [12]:
df_list.loc[1]

Name            Jon
Age              25
Location    Seattle
Name: 1, dtype: object

In [13]:
df_list.drop(3)

   Name  Age  Location
1   Jon   25   Seattle
2  Robb   30  New York

In [14]:
df_list.isnull()

    Name    Age  Location
1  False  False     False
2  False  False     False
3  False  False     False

In [16]:
data = (
    ("Jon", 25, "Seattle"),
    ("Robb", 30, "New York"),
    ("Danerys", 35, "Kona")
)

df_tuple = pd.DataFrame(
    data,
    columns=["Name", "Age", "Location"],
    index=[1, 2, 3]
)

df_tuple

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [17]:
df_tuple.head()

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [18]:
df_tuple.tail()

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [19]:
df_tuple.shape

(3, 3)

In [20]:
df_tuple.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [21]:
df_tuple.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [22]:
df_tuple["Age"].max()

35

In [23]:
df_tuple["Age"].min()

25

In [24]:
df_tuple["Age"].mean()

np.float64(30.0)

In [25]:
df_tuple.loc[1]

Name            Jon
Age              25
Location    Seattle
Name: 1, dtype: object

In [26]:
df_tuple.iloc[0:]

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [27]:
data = {
    "Name": ["Jon", "Robb", "Danerys"],
    "Age": [25, 30, 35],
    "Location": ["Seattle", "New York", "Kona"]
}

df_dict = pd.DataFrame(data, index=[1, 2, 3])

df_dict

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [28]:
df_dict.head()

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [29]:
df_dict.tail()

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [30]:
df_dict.shape

(3, 3)

In [31]:
df_dict.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [32]:
df_dict.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [33]:
df_dict["Age"].max()

35

In [34]:
df_dict["Age"].min()

25

In [35]:
df_dict["Age"].mean()

np.float64(30.0)

In [36]:
df_dict.drop_duplicates()

      Name  Age  Location
1      Jon   25   Seattle
2     Robb   30  New York
3  Danerys   35      Kona

In [37]:
df_dict.loc[2]

Name            Robb
Age               30
Location    New York
Name: 2, dtype: object

In [38]:
df_dict.iloc[1:]

      Name  Age  Location
2     Robb   30  New York
3  Danerys   35      Kona